// - створити 2 форми  по 2 інпути в кожній. ствоирити кнопку при кліку
// на яку считується та виводиться на консоль інформація з цих 2х форм.
//     Кнопка повинна лежати за межами форм (Щоб ьуникнути  перезавантаження сторінки)
// Доступ до інпутів через Forms API. Отже дайте формі та інпутам всі необхідні атрибути.

// document.getElementById('btn').onclick = function () {
//     let i1 = document.forms.f1.i11.value;
//     let i2 = document.forms.f1.i12.value;
//     let i3 = document.forms.f1.i21.value;
//     let i4 = document.forms.f1.i22.value;
//     console.log(i1, i2, i3, i4)
//
// }


// - Створити 3 инпута та кнопку. Один визначає кількість рядків, другий - кількість ячеєк, третій вмиіст ячеєк.
//     При натисканні кнопки, вся ця інформація зчитується і формується табличка, з відповідним вмістом.
// (Додатковачастина для завдання)
//
//
// - Сворити масив не цензцрних слів.
//     Сворити інпут текстового типу.
//     Якщо людина вводить слово і воно міститься в масиві не цензурних слів
// кинути алерт з попередженням.
//     Перевірку робити при натисканні на кнопку
//
//
// - Сворити масив не цензцрних слів.
//     Сворити інпут текстового типу.
//     Потрібно перевіряти чи не містить ціле речення в собі погані слова.
//     Кинути алерт з попередженням у випадку якщо містить.
//     Перевірку робити при натисканні на кнопку

let a = 10;
function f(){
    if (a){
        console.log(a)
        let a = 5;
    }
}
f();